--复杂数据类型table
--所有的复杂类型都是table(表)
print("*****************Table*****************")

--数组
a = {1,2,nil,4,5,"122",nil}
print(a[1])   --下标起始为1
--#是通用的获取长度的关键字
--在打印长度的时候 空被忽略
--如果表中(数组中)某一位变成nil 会影响#获取的长度
--nil导致#读取数组长度时的不确定性
print(#a)       

b = {1,2,nil,5,6,7,nil,8,9,nil,nil}
print(#b)

--数组的遍历
for i=1,#a do   --#遍历,不可靠
print(a[i])
end

--二维数组
a = {
    {1,2,3},
    {4,5,6},
    {7,8,9}
}
print(a[1][1])
print()
for i = 1, #a do
    b = a[i]
    for j = 1, #b do
        print(b[j])
    end
end

--自定义索引
print()
aa = {[0]= 2,1,2,3,[-1] = 7}
print(aa[0])
print(#aa)  --#获取长度的时候 还是从下标1开始  所以会忽略掉-1,0 然后在按顺序排列其他数据 

